In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('F:\\dataset\\student_results.csv')
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10.0,2,9.0,3,5,50.0
1,1002,10.0,6,8.0,2,0,80.0
2,1003,NaN,3,8.0,2,4,60.0
3,1004,11.0,0,10.0,1,5,45.0
4,1005,11.0,4,7.0,2,0,NaN
5,1006,77.0,4,7.0,5,2,9.0
6,1007,12.0,4,NaN,0,0,80.0
7,1008,12.0,10,6.0,2,0,90.0
8,1009,12.0,2,8.0,2,4,60.0
9,1010,12.0,6,9.0,1,0,85.0

In [3]:
df.loc[0]

Student ID                1001.0
Class                       10.0
Study hrs                    2.0
Sleeping hrs                 9.0
Social Media usage hrs       3.0
Mobile Games hrs             5.0
Percantege                  50.0
Name: 0, dtype: float64

In [4]:
df.loc[[1,2]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
1,1002,10.0,6,8.0,2,0,80.0
2,1003,NaN,3,8.0,2,4,60.0

In [9]:
df.loc[[3,4]

SyntaxError: unexpected EOF while parsing (<ipython-input-9-4c77ec94028c>, line 1)

In [10]:
df.loc[3,'Class']

11.0

In [12]:
df.loc[0:3,'Class']

0    10.0
1    10.0
2     NaN
3    11.0
Name: Class, dtype: float64

In [13]:
df['Class']

0    10.0
1    10.0
2     NaN
3    11.0
4    11.0
5    77.0
6    12.0
7    12.0
8    12.0
9    12.0
Name: Class, dtype: float64

In [19]:
df.loc[df['Class']>11.0,['Percantege']]

   Percantege
5         9.0
6        80.0
7        90.0
8        60.0
9        85.0

In [20]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [21]:
df.iloc[0,1]

10.0

In [22]:
df.iloc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10.0,2,9.0,3,5,50.0
1,1002,10.0,6,8.0,2,0,80.0